# 슬라이스 사용하기
a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
print(a[0:4])
print(a[0:10])
print(a[1:1])
print(a[1:2])
print(a[4:7])
print(a[4:-1])
print()

# 인덱스 증가폭 사용
a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
print(a[2:8:3])
print(a[2:9:3])
print()

# 인덱스 생략
a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
print(a[:7])
print(a[7:])
print(a[:])
print(a[:7:2])
print(a[7::2])
print(a[::2])
print(a[::])
print()

# len 응용
a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
b = (0, 10, 20, 30, 40, 50, 60, 70, 80, 90)
print(a[0:len(a)])
print(a[:len(a)])
print(b[4:7])
print(b[4:])
print(b[:7:2])

# 슬라이스에 요소 할당
a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
a[2:5] = ['a', 'b', 'c']
print(a)
print()

# del로 슬라이스 삭제
a = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90]
del a[2:5]
print(a)